In [17]:
import pandas as pd
from pandas import Series, DataFrame

In [18]:
obj = pd.Series([4, 7, -5, 3])
# the numbers in brackets are all included in the same column
# index is generated for each starting from 0

In [19]:
obj
# out displays the index in the left column and the numbers in the array in the right one

0    4
1    7
2   -5
3    3
dtype: int64

In [20]:
obj.values
# displays values included in the array

array([ 4,  7, -5,  3])

In [21]:
obj.index
# description of default indexing
# starting at 0, ending at 4 -- 0, 1, 2, 3 are displayed

RangeIndex(start=0, stop=4, step=1)

In [22]:
obj2 = pd.Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])
# indexing in order, d, 4 - b, 7 etc

In [23]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [24]:
obj2.index
# we also get info on the dtype (Type of data: integer, float, Python object etc.)

Index(['d', 'b', 'a', 'c'], dtype='object')

In [25]:
obj2['a']

-5

In [26]:
obj2['d']

4

In [27]:
obj2['d'] = 6

In [28]:
obj2[['c', 'a', 'd']]
# this is interpreted as indices

c    3
a   -5
d    6
dtype: int64

In [29]:
obj2[obj2 > 0]
# displays int bigger than 0

d    6
b    7
c    3
dtype: int64

In [30]:
obj2 * 2
# multiplies each number in the array with 2

d    12
b    14
a   -10
c     6
dtype: int64

In [31]:
import numpy as np

In [32]:
np.exp(obj2)
# 2.718281, Euler's number is exp
# calc this separately!

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [33]:
'b' in obj2

True

In [34]:
'e' in obj2

False

In [35]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [36]:
obj3 = pd.Series(sdata)
# displays columns and rows, in left column the key and on the right the value

In [37]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [38]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [39]:
obj4 = pd.Series(sdata, index=states)
# assign order for indexing. if the index is not existing, response NaN

In [40]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [41]:
pd.isnull(obj4)
# bool to test which have no values

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [42]:
pd.notnull(obj4)
# bool to check which have values

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [43]:
obj4.isnull()
# this have the same outcome as pd.isnull(obj4)
# either obj used instead of pd or as argument

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [44]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [45]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [46]:
obj3 + obj4
# if int and float are combined the dtype will be float

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [47]:
obj4.name = 'population'
# display at the bottom next to data type

In [48]:
obj4.index.name = 'state'
# displays at the top left

In [49]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [50]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [51]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [52]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [53]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
# these each have their own column, with key name and list values below

In [54]:
frame = pd.DataFrame(data)

In [55]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [56]:
frame.head()
# displays the first five rows

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [57]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
            index=['one', 'two', 'three', 'four', 'five', 'six'])
# defining index/rows and categories/columns

In [58]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [59]:
frame2.columns
# displays categories/keys for columns and dtype

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [60]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [61]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [62]:
frame2.loc['three']
# displays all keys and values for index 'three'
# loc is locator attribute

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [63]:
frame2['debt'] = 16.5

In [64]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [65]:
frame2['debt'] = np.arange(6.)
# np.arange will use numbers 0-5 for the column 'debt'

In [66]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [67]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [68]:
frame2['debt'] = val

In [69]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [70]:
frame2['eastern'] = frame2.state == 'Ohio'
# creates a new column called 'easterns'

In [90]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [91]:
del frame2['eastern']

KeyError: 'eastern'

In [ ]:
frame2.columns

In [ ]:
pop = {'Nevada': {2001: 2.4, 2002:2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
# outer keys are interpreted as columns
# NaN value will be displayed at the end

In [ ]:
frame3 = pd.DataFrame(pop)

In [ ]:
frame3

In [ ]:
frame3.T
# swapping the rows with the columns

In [ ]:
pd.DataFrame(pop, index=[2001, 2002, 2003])
# rows are indexes and defined to be the years

In [ ]:
pdata = {'Ohio': frame3['Ohio'][:-1],
    'Nevada': frame3['Nevada'][:2]}
# this way is deprecated. we should use series.loc[i:j]

In [ ]:
pd.DataFrame(pdata)

In [ ]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [ ]:
frame3

In [ ]:
frame3.values

In [ ]:
frame2.values

In [ ]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [ ]:
index = obj.index

In [ ]:
index

In [ ]:
index[1:]

In [92]:
index[1] = 'd'
# typ error. Index objects are immutable/can't be modified

TypeError: Index does not support mutable operations

In [93]:
labels = pd.Index(np.arange(3))

In [94]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [95]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [96]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [97]:
obj2.index is labels

True

In [98]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [99]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [100]:
'Ohio' in frame3.columns

True

In [101]:
2003 in frame3.index

False

In [102]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [103]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [104]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [105]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [106]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [107]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [108]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [109]:
obj3.reindex(range(6), method='ffill')
# filling value in range six. blue, purple and yellow will all appear twice.

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [110]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), 
index=['a', 'c', 'd'],
columns=['Ohio', 'Texas', 'California'])
# nine values, shaped in three rows and three columns

In [111]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [112]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [113]:
frame2
# with reindexing another index was added that contain no value, hence NaN

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [114]:
states = ['Texas', 'Utah', 'California']

In [115]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [116]:
frame.loc[['a', 'b', 'c', 'd'], states]
# returns - 'b' is not an index

KeyError: "['b'] not in index"

In [ ]:
obj = pd.Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])

In [ ]:
new_obj = obj.drop('c')
# removing 'c' row

In [ ]:
new_obj

In [ ]:
obj.drop(['d', 'c'])
# drop removes the defined indexes
# important with [] when more than one

In [ ]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    # arranging number 0-15 in four rows and four columns
index = ['Ohio', 'Colorado', 'Utah', 'New york'],
columns = ['one', 'two', 'three', 'four'])

In [ ]:
data

In [117]:
data.drop(['Colorado', 'Ohio'])
# the whole rows and values are removed

AttributeError: 'dict' object has no attribute 'drop'

In [118]:
data.drop('two', axis=1)
# removed the column two and all values

AttributeError: 'dict' object has no attribute 'drop'

In [119]:
data.drop(['two', 'four'], axis='columns')
# removes two and four columns with all values

AttributeError: 'dict' object has no attribute 'drop'

In [120]:
obj.drop('c', inplace=True)
# manipulate object without returning a new object
# inplace destroys and data that is dropped

In [121]:
obj

d    4.5
b    7.2
a   -5.3
dtype: float64

In [122]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
# when a number with dot - 4. is used it defines that the number is a float

In [123]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [124]:
obj['b']
# using list indexing to get the value

1.0

In [125]:
obj[1]
# this and obj['b'] will reach the same result as obj['b'] in this case
# it refers to index 1

1.0

In [126]:
obj[2:4]
# displays position 2 and 3 with values

c    2.0
d    3.0
dtype: float64

In [127]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [128]:
obj[[1, 3]]
# returns index name and value for index 1 and 3

b    1.0
d    3.0
dtype: float64

In [129]:
obj[obj<2]
# returns index name and value for all objects with value that is less than 2

a    0.0
b    1.0
dtype: float64

In [130]:
obj['b':'c']
# return values for index 'b' and 'c'

b    1.0
c    2.0
dtype: float64

In [131]:
obj['b':'c'] = 5
# changing value for 'b' and 'c' to 5

In [132]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [133]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index = ['Ohio', 'Colorado', 'Utah', 'New york'],
                   columns = ['one', 'two', 'three', 'four'])

In [134]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New york   12   13     14    15

In [135]:
data['two']
# returns all values in column 'two'

Ohio         1
Colorado     5
Utah         9
New york    13
Name: two, dtype: int64

In [136]:
data[['three', 'one']]
# returns all values in columns'three and 'one', in the defined order 'three' first and then 'one'

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New york     14   12

In [137]:
data[:2]
# slices the rows, returning all columns and the two first rows with values (index 0 and 1)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [138]:
data[data['three'] > 5]
# need more context

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New york   12   13     14    15

In [139]:
data < 5
# bool comparison
# is the data in data smaller than 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New york  False  False  False  False

In [140]:
data[data < 5] = 0
# all values that are smaller than 5 equals 0

In [141]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New york   12   13     14    15

In [142]:
data.loc['Colorado', ['two', 'three']]
# returns 'Colorado' value for columns 'two' and 'three'

two      5
three    6
Name: Colorado, dtype: int64

In [143]:
data.iloc[2, [3, 0, 1]]
# '2' is index rows which is 'Utah'
# '3', '0', '1' is the index number is the value and the order in which they will be returned
# the column names will return as index name in this case ie. 'four' 11, 'one' 8, 'two' 9

four    11
one      8
two      9
Name: Utah, dtype: int64

In [144]:
data.iloc[2]
# if only the index row is specified then index will return as 'name' at the bottom  left
# column name will return as index names for rows
# the values will be returned in order specified in the variable 'data' ('one', 'two', 'three', 'four')

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [145]:
data.iloc[[1, 2], [3, 0, 1]]
# [1, 2] is index position for row index
# [3, 0, 1] is the index position for the columns and also the order in which they will be returned

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [146]:
data.loc[:'Utah', 'two']
# row index names will be returned until 'Utah'
# the values return are included in column 'two'

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [147]:
data.iloc[:, :3][data.three > 5]
# [:, :3] is returning the three first columns
# [data.three > 5] returns the three first rows with values bigger than 5

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New york   12   13     14

In [148]:
ser = pd.Series(np.arange(3.))
# arranging three number starting from 0 using float

In [149]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [150]:
ser[-1]
# this doesn't work

KeyError: -1

In [ ]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [ ]:
ser2[-1]
# when we specify the index we can call for the last item with -1

In [ ]:
ser.iloc[-1]
# if we instead of just calling for the last index in as list use iloc, the value will be returned

In [ ]:
ser[:2]
# slicing until index two

In [ ]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a','c', 'd', 'e'])

In [ ]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a','c', 'e', 'f', 'g'])

In [ ]:
s2

In [ ]:
s1+s2
# Nan is because only one of them have the index 'd', 'f', 'g' with value

In [ ]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bde'), 
                   index=['Ohio', 'Texas', 'Colorado'])

In [ ]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [151]:
df1

NameError: name 'df1' is not defined

In [152]:
df2

NameError: name 'df2' is not defined

In [153]:
df1+df2
# same here as above. The values cannot me merged if only one of the frames have index and value

NameError: name 'df1' is not defined

In [154]:
df1 = pd.DataFrame({'A':[1, 2]})
# one column, two rows. The name of the column is 'A', the values is 1 and 2 (index will generate as 0 and 1)

In [155]:
df2 = pd.DataFrame({'B':[3, 4]})

In [156]:
df1

   A
0  1
1  2

In [157]:
df2

   B
0  3
1  4

In [158]:
df1-df2

    A   B
0 NaN NaN
1 NaN NaN

In [159]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
# arranging number 0-11 in three rows and four columns with column names, 'a', 'b', 'c', 'd'

In [160]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [161]:
df2.loc[1, 'b'] = np.nan
# defining index position 0, column 'b' to be NaN

In [162]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [163]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [164]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [165]:
df1.add(df2, fill_value=0)
# add() adds the number id df1 with the number in the same position in df2

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [166]:
1/df1
# one divided by each number in df1. result displayed in same same position as previously

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [167]:
df1.rdiv(1)
# this is the same as 1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [168]:
df1.reindex(columns=df2.columns, fill_value=0)
# df1 have four columns. when reindexing adding a columns from df2 'e' and filling it with the value 0

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [169]:
arr = np.arange(12.).reshape((3, 4))

In [170]:
arr[0]
# returns the first row out of three, index 0

array([0., 1., 2., 3.])

In [171]:
arr - arr[0]
# every number in every row in arr minus the number in the same column in the first row arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [172]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                    columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [173]:
series = frame.iloc[0]
# this points to row one (index 0). The column names becomes the name of the rows
# and the values all become values in the same column
# this is for the index that is pointed to, in this case 'Utah'

In [174]:
frame
# as defined in variable 'frame' - there are three columns: 'b', 'd', 'e' and four rows with the given names
# the values are 0-11

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [175]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [176]:
frame - series  
# the numbers in the first columns minus the number in the first row in series (whih is 0)
# the second column minus the second row (which is 1)
# and the numbers in the third column minus the number in the third row in series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [177]:
series2 = pd.Series(range(3), index=['b', 'e', 'f' ])
# the values in series 2 is 0, 1 and 2

In [178]:
frame + series2
# each number in column b will be added with number 0
# the next column 'e' - each number will be added with 1
# d is not existing for series 2 and cannot be merged
# f will again not be possible as it is not existing for frame and returns NaN

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [179]:
series3 = frame['d']
# return the values in column 'd'

In [180]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [181]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [182]:
frame.sub(series3, axis='index')
# sub() is subtraction frame - series3
# series3 is 1, 4, 7, 10
# we take each value in series and subtract this value from the value in each value in the column in frame
# ie. 0-1, 3-4, 6-7, 9-10 in the fist column

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [183]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])
#  random randn generates normally distributed numbers from a normal distribution 
# that has a mean of 0 and a standard deviation of 1.

In [184]:
frame

               b         d         e
Utah   -0.385870  1.140165 -0.253562
Ohio   -0.614639  0.104916 -0.037168
Texas  -1.469364 -0.015549  0.808572
Oregon  0.633840  0.577653 -1.019252

In [185]:
np.abs(frame)
# abs calculates the absolute value

               b         d         e
Utah    0.385870  1.140165  0.253562
Ohio    0.614639  0.104916  0.037168
Texas   1.469364  0.015549  0.808572
Oregon  0.633840  0.577653  1.019252

In [186]:
f = lambda x: x.max() - x.min()
# in this case it would be better to define the function f more explicitly:
# def f(x):
#    return x.max() - x.min()

In [187]:
frame.apply(f)

b    2.103204
d    1.155715
e    1.827825
dtype: float64

In [188]:
frame.apply(f, axis='columns')

Utah      1.526035
Ohio      0.719555
Texas     2.277936
Oregon    1.653092
dtype: float64

In [189]:
fr1 = pd.DataFrame(np.arange(9).reshape((3,3)), columns=list('abc'))

In [190]:
fr1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [191]:
fr1.apply(f)

a    6
b    6
c    6
dtype: int64

In [192]:
fr1.apply(f, axis="columns")

0    2
1    2
2    2
dtype: int64

In [193]:
fr1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [194]:
fr1.T

   0  1  2
a  0  3  6
b  1  4  7
c  2  5  8

In [195]:
foo=[1,2,3,4,5,6]; evens=list(filter(lambda x:(x%2==0), foo))

In [196]:
foo

[1, 2, 3, 4, 5, 6]

In [197]:
evens

[2, 4, 6]

In [200]:
frame.apply(f, axis='columns')
# when defining axis = max number - min number on rows onstead of columns
# the state names remain indexes and the result is displayed in the second column

Utah      1.526035
Ohio      0.719555
Texas     2.277936
Oregon    1.653092
dtype: float64

In [203]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
# the column names is as defined in frame
# index is defined as 'min' and 'max'
# return the lowest and the highest numbers

In [202]:
frame.apply(f)

            b         d         e
min -1.469364 -0.015549 -1.019252
max  0.633840  1.140165  0.808572

In [206]:
format = lambda x: '%.2f' % x
# the float will have two decimal numbers

In [207]:
frame.applymap(format)

            b      d      e
Utah    -0.39   1.14  -0.25
Ohio    -0.61   0.10  -0.04
Texas   -1.47  -0.02   0.81
Oregon   0.63   0.58  -1.02

In [209]:
frame['e'].map(format)
# returns the values in column 'e'
# format still apllied, so two decimal numbers

Utah      -0.25
Ohio      -0.04
Texas      0.81
Oregon    -1.02
Name: e, dtype: object